Revit 2027 API
BuiltInFailures.RebarFailures.HideAllBarsInRebarSet Property
 All Bars in Rebar Set have been hidden.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HideAllBarsInRebarSet { get; }
Public Shared ReadOnly Property HideAllBarsInRebarSet As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HideAllBarsInRebarSet {
	FailureDefinitionId^ get ();
}
static member HideAllBarsInRebarSet : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace